// ДОМАШНЯ РОБОТА.

// 1. Запросите у пользователя его имя и выведите в ответ: «Привет, его имя!».
let userName = prompt('Як тебе звати?', "Ім'я");
console.log(`Привіт, ${userName} !`);

alert(`Привіт, ${userName} !`);

// 2. Запросите у пользователя год его рождения, посчитайте, сколько ему лет и выведите результат. Текущий год укажите в коде как константу.
let yearOfBorn = prompt('Який рік твого народження?', 0);
let age;
const yearNow = 2020;

age = yearNow - yearOfBorn;

console.log(`Твій вік, ${age} років`);
alert(`Твій вік, ${age} років`);

// 3. Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата.
let aSide = prompt('Введіть довжину сторони квадрата!', 0);
let per = aSide * 4;

console.log(`Периметр квадрата - ${per}`);
alert(`Периметр квадрата - ${per}`);

// 4. Запросите у пользователя радиус окружности и выведите площадь такой окружности.
let r = prompt('Введіть радіус кола', 0);
let S = Math.PI * (r ** 2);

console.log(`Площа кола - ${S}`);
alert(`Площа кола - ${S}`);

// 5. Запросите у пользователя расстояние в км между двумя городами и за сколько часов он хочет добраться. Посчитайте скорость, с которой необходимо двигаться, чтобы успеть вовремя.
let sTown = prompt('Введіть відстань між містами (км.)', 0);
let t = prompt('За скільки часу потрібно доїхати (год.)?', 0);
let V = sTown / t;

console.log(`Рекомендована швидкість - ${V} км./год.`);
alert(`Рекомендована швидкість - ${V} км./год.`);

// 6. Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро. Курс валюты храните в константе.
let dolar = prompt('Сума в доларах', 0);
let euro;
const kursEuro = 0.94;

euro = dolar * kursEuro;

console.log(`Сума в євро - ${euro}`);
alert(`Сума в євро - ${euro}`);

// 7. Пользователь указывает объем флешки в Гб. Программа должна посчитать, сколько файлов размером в 820 Мб помещается на флешку.
let fleshSize = prompt("Вкажіть об'єм флеш-накопочувача (Гб)", 0)
let files;

files = Math.trunc(fleshSize / 0.84);

console.log(`На флешку поміститься ${files} файлів`);
alert(`На флешку поміститься ${files} файлів`);

// 8. Пользователь вводит сумму денег в кошельке и цену одной шоколадки. Программа выводит, сколько шоколадок может купить пользователь, и сколько сдачи у него останется.
let wallet = prompt("Cума грошей в гаманці. (грн)", 0);
let chocolatePrice = prompt("Ціна однієї шоколадки. (грн)", 0);
let chocolate;

chocolate = Math.trunc(wallet / chocolatePrice);
wallet = wallet - chocolate * chocolatePrice;
wallet = wallet.toFixed(2);

console.log(`Ви можете купити ${chocolate} шоколадок, а у гаманці залишиться ${wallet} грн.`);
alert(`Ви можете купити ${chocolate} шоколадок, а у гаманці залишиться ${wallet} грн.`);

// 9. Запросите у пользователя трехзначное число и выведите его задом наперед. Для решения задачи вам понадобится оператор % (остаток от деления).
let userNum = prompt("Введіть трьох значне число", 0);
let reNum;

reNum = (userNum % 10) * 100 + Math.trunc(userNum / 10 % 10) * 10 + Math.trunc(userNum / 100);

console.log(`Твоє число задом на перед - ${reNum}`);
alert(`Твоє число задом на перед - ${reNum}`);

// 10. Пользователь вводит сумму вклада в банк на 2 месяца, с процентной ставкой депозита 5% годовых. Вывести сумму начисленных процентов.
let vklad = prompt("Введіть суму вкладу. (грн)", 0);
let profit;

profit = vklad * 0.05 / 6;
profit = profit.toFixed(2);

console.log(`Cума нарахованих відсотків - ${profit} грн.`);
alert(`Сума нарахованих відсотків - ${profit} грн.`);